In [1]:
import numpy as np
import pandas as pd

In [2]:
#seed the random number generator
np.random.seed(42) 
#why do we often use 42 as the parameter here? 
#See https://www.kaggle.com/questions-and-answers/180377

Create a dataframe named df by using the DataFrame method in pandas.

In [4]:
df = pd.DataFrame(np.random.randint(0, 10, (3, 4)), index = [0, 1, 2],
                  columns=['A', 'B', 'C', 'D'])

Do the following in order and show the contents of the dataframe after each step:
1. show the contents of the dataframe
2. add a column named E with the values 7  4   3
3. add a column F where each row has the sum of the values from columns A and B
4. drop column D -- be sure that the dataframe no longer has this column
5. add a row with index 3 with all values of 0
6. give three ways of printing out the value of the element in the row with index 1 and column B

In [5]:
df.head()

   A  B  C  D
0  7  2  5  4
1  1  7  5  1
2  4  0  9  5

In [14]:
df

   A  B  C  D  E
0  7  2  5  4  7
1  1  7  5  1  4
2  4  0  9  5  3

In [9]:
df.describe()

         A         B         C         D
count  3.0  3.000000  3.000000  3.000000
mean   4.0  3.000000  6.333333  3.333333
std    3.0  3.605551  2.309401  2.081666
min    1.0  0.000000  5.000000  1.000000
25%    2.5  1.000000  5.000000  2.500000
50%    4.0  2.000000  5.000000  4.000000
75%    5.5  4.500000  7.000000  4.500000
max    7.0  7.000000  9.000000  5.000000

In [10]:
df.shape

(3, 4)

In [11]:
len(df)

3

In [18]:
# add a column named E with the values 7 4 3
df['E'] = [7,4,3]
df

   A  B  C  D  E
0  7  2  5  4  7
1  1  7  5  1  4
2  4  0  9  5  3

In [37]:
# add a column F where each row has the sum of the values from columns A and B
df['F'] = df['A'] + df['B']
df

   A  B  C  D  E  F
0  7  2  5  4  7  9
1  1  7  5  1  4  8
2  4  0  9  5  3  4

In [35]:
# drop column D -- be sure that the dataframe no longer has this column
df.drop('D', axis=1)

   A  B  C  E  F
0  7  2  5  7  9
1  1  7  5  4  8
2  4  0  9  3  4

In [44]:
# add a row with index 3 with all values of 0
df.loc[len(df)] = 0
df.drop
df

   A  B  C  D  E  F
0  7  2  5  4  7  9
1  1  7  5  1  4  8
2  4  0  9  5  3  4
3  0  0  0  0  0  0
4  0  0  0  0  0  0

In [ ]:
# give three ways of printing out the value of the element in the row with index 1 and column B